#Задание 15-2
import re
string=input("Введите номера машин:")
regex=r'\b[EЕ,AА,TТ,YУ,OО,PР,HН,KК,XХ,CС,BВ,MМ]\d\d\d[EЕ,AА,TТ,YУ,OО,PР,HН,KК,XХ,CС,BВ,MМ]{2}[1][7][8]|[EЕ,AА,TТ,YУ,OО,PР,HН,KК,XХ,CС,BВ,MМ]\d\d\d[EЕ,AА,TТ,YУ,OО,PР,HН,KК,XХ,CС,BВ,MМ]{2}[7][8]\b'
print(re.findall(regex,string))

#Задание 15-3
import re
string=' Мой телефон +7(812)123-1234,+7(921)123-1234, +7(812)123-12-12, +7(921)123-12-12 ,+7(911)123-12-12,+7(811)123-1234,+7(911)123-12-12'
regex=(r'[\+][7][(][8][1][2][)]\d{3}-\d{4}|[\+][7][(][8][1][2][)]\d{3}-\d{2}-\d{2}|[\+][7][(][9][2][1][)]\d{3}-\d{4}|[\+][7][(][9][2][1][)]\d{3}-\d{2}-\d{2}')
print(re.findall(regex,string))